In [22]:
import pandas as pd
from sklearn.ensemble import RandomForestClassifier

In [2]:
PATH = '../data/'

In [16]:
df_train = pd.read_csv(f'{PATH}train.csv', index_col='PassengerId')
df_test = pd.read_csv(f'{PATH}test.csv', index_col='PassengerId')

In [17]:
df_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Fill Missing Values

In [21]:
target = df_train['Survived']
df_train = df_train.drop('Survived', axis=1)
df_train['training_set'] = True
df_test['training_set'] = False
df_full = pd.concat([df_train, df_test])
df_full = df_full.interpolate()

In [23]:
## get_dummies does one-hot encoding
df_full = pd.get_dummies(df_full)

## Recreate df_train and df_test
df_train = df_full[df_full['training_set']==True]
df_train = df_train.drop('training_set', axis=1)
df_test = df_full[df_full['training_set']==False]
df_test = df_test.drop('training_set', axis=1)

## Create Model

In [26]:
rfc = RandomForestClassifier()
rfc_model = rfc.fit(df_train, target)

## Check the score
rfc_model.score(df_train, target)

0.9820426487093153

In [27]:
## Predictions
predictions = rfc.predict(df_test)

In [28]:
## Submissions
my_submission = pd.DataFrame({'PassengerId': df_test.index, 'Survived': predictions})
my_submission.to_csv(f'{PATH}submission_random_forest_classifer.csv', index=False)